# Уроки на pythontutor.ru
# Дано число n. С начала суток прошло n минут.
# Определите, сколько часов и минут будут показывать
# электронные часы в этот момент.
# Программа должна вывести два числа: количество часов (от 0 до 23)
# и количество минут (от 0 до 59).
# Учтите, что число n может быть больше, чем количество минут в сутках.

print("Введите количество минут с начала суток:", end=" ")
n = int(input())		# Количество минут с начала суток
p = n//60
d = p//24
h = p % 24
m = n % 60
print("Прошло", d, "сут.")
print("Время на часах:", end=" ")
print(h, m, sep=":")
