# Уроки на pythontutor.ru
# Напишите программу, которая приветствует пользователя,
# выводя слово Hello, введенное имя и знаки препинания по образцу:
# Hello, Harry!

print("Как тебя зовут?")
n = input()
print("Привет, ", n, "!", sep="")
