# Уроки на pythontutor.ru

print("Найдите наименьшее из двух чисел.")
print("Введите первое число:", end="\t")
a = int(input())
print("Введите второе число:", end="\t")
b = int(input())
if a < b:
    print("Первое число меньше, это", a)
else:
    print("Второе число меньше, это", b)
